export default function RulesPage() {
  return (
    <main className="min-h-screen p-6 md:p-16 text-white">
      <h1 className="text-3xl font-bold mb-6">Правила использования и цитирования</h1>

      <section className="prose prose-invert text-white/80">
        <p>
          Полное копирование материалов разрешено только с письменного согласия редакции. При частичном использовании материалов активная гиперссылка обязательна.
        </p>
        <h4>Использование изображений</h4>
        <p>
          В случае необходимости использования фото, видео и иных материалов обращайтесь к правообладателю.
        </p>

        <h4>Правообладателям</h4>
        <p>
          Если вы — правообладатель и обнаружили контент, использованный без согласия, пожалуйста, свяжитесь с нами — материал будет удалён.
        </p>
      </section>
    </main>
  );
}
